* Papa February 10 
   :PROPERTIES:
   :Effort:   22
   :END:
   :LOGBOOK:
   CLOCK: [2020-02-10 Mon 12:33]--[2020-02-10 Mon 12:59] =>  0:26
   CLOCK: [2020-02-10 Mon 09:37]--[2020-02-10 Mon 11:08] =>  1:31
   :END:
* Papa Feb 11
  :PROPERTIES:
  :Effort:   25
  :END:
  :LOGBOOK:
  CLOCK: [2020-02-11 Tue 09:35]--[2020-02-11 Tue 10:02] =>  0:27
  :END:
** Process
   :PROPERTIES:
   :Effort:   0:25
   :END:
   :LOGBOOK:
   CLOCK: [2020-02-11 Tue 10:06]--[2020-02-11 Tue 11:52] =>  1:46
   :END:

A. Setup
 - [X] Put nodes in a list
 - [ ] setup log
B. Do for all positions:
 - Iterate over nodes, 
   1. return <RESULT> when sucess
   2. log failure
      - [X] capture the error
      - [ ] get input
     
